---
kind: property
id: P:Autodesk.Revit.DB.ImageType.Source
source: html/ebd4da4a-d8da-fe29-8eb4-0c20b678ae02.htm
---
# Autodesk.Revit.DB.ImageType.Source Property

The source of the image in the ImageType.

## Syntax (C#)
```csharp
public ImageTypeSource Source { get; }
```